#include <iostream>
using namespace std;

int main()
{
    //Integer21◦
       // .С начала суток прошло N секунд(N — целое).Найти количество секунд, прошедших с начала последней минуты.
   // int n, b;
   // cin >> n;
  //  b = n % 60;
   // cout << b << endl;
   // Integer20◦
      //  .С начала суток прошло N секунд(N — целое).Найти количество полных часов, прошедших с начала суток.
   // int n, c;
  //  cin >> n;
  //  c = n / 3600;
    //cout << c << endl;






    return 0;
}
    
